# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них
import random

def max_number(a, b, c):
    return max(a, b, c)

a, b, c = 3, 5312 ,102
print(max_number(a, b, c))